In [1]:
%reload_ext sql

In [4]:
%%sql
sqlite:///CourseDataWarehouse1.db

'Connected: @CourseDataWarehouse1.db'

CREATE THE LOCATION TABLE

In [22]:
%%sql
DROP TABLE Location;
CREATE TABLE Location(
    location_ID INTEGER PRIMARY KEY AUTOINCREMENT,
    location TEXT NOT NULL
    );

   sqlite:///CourseDataWarehouse.db
 * sqlite:///CourseDataWarehouse1.db
Done.
Done.

[]

In [23]:
%%sql
INSERT INTO Location (location)
SELECT DISTINCT location
FROM coursemeetings;

   sqlite:///CourseDataWarehouse.db
 * sqlite:///CourseDataWarehouse1.db
208 rows affected.

[]

In [25]:
%%sql
SELECT *
FROM Location
LIMIT 20;

   sqlite:///CourseDataWarehouse.db
 * sqlite:///CourseDataWarehouse1.db
Done.

[(1, 'DSB 105'),
 (2, 'DSB 111'),
 (3, 'DSB 110A'),
 (4, 'DSB 108'),
 (5, 'DSB 110B'),
 (6, 'DSB 104'),
 (7, 'DSB 112'),
 (8, 'DSB 109'),
 (9, 'DSB 115'),
 (10, 'DSB 2109A'),
 (11, 'CNS 5'),
 (12, 'CNS 108'),
 (13, 'CNS 106'),
 (14, 'BNW 254'),
 (15, 'SON 124'),
 (16, 'CNS 303'),
 (17, 'CNS 305'),
 (18, 'BNW 137'),
 (19, 'CNS 15'),
 (20, 'CNS 208')]

CREATE THE COURSE INFO TABLE

In [30]:
%%sql
DROP TABLE Course_Info;
CREATE TABLE Course_Info (
    course_ID INTEGER PRIMARY KEY AUTOINCREMENT,
    term TEXT NOT NULL,
    section TEXT NOT NULL,
    title TEXT NOT NULL,
    primary_instructor TEXT NOT NULL
    );

   sqlite:///CourseDataWarehouse.db
 * sqlite:///CourseDataWarehouse1.db
Done.
Done.

[]

In [32]:
%%sql
INSERT INTO Course_Info (term, section, title, primary_instructor)
SELECT DISTINCT term, section, title, primary_instructor
FROM courses;

   sqlite:///CourseDataWarehouse.db
 * sqlite:///CourseDataWarehouse1.db
15446 rows affected.

[]

In [33]:
%%sql
SELECT *
FROM Course_Info
LIMIT 10;

   sqlite:///CourseDataWarehouse.db
 * sqlite:///CourseDataWarehouse1.db
Done.

[(1, 'Fall2014', 'C01', 'Introduction to Financial Accounting', 'Michael P.  Coyne'),
 (2, 'Fall2014', 'C02', 'Introduction to Financial Accounting', 'Michael P.  Coyne'),
 (3, 'Fall2014', 'C03', 'Introduction to Financial Accounting', 'Michael P.  Coyne'),
 (4, 'Fall2014', 'C04', 'Introduction to Financial Accounting', 'Rebecca I.  Bloch'),
 (5, 'Fall2014', 'C05', 'Introduction to Financial Accounting', 'Rebecca I.  Bloch'),
 (6, 'Fall2014', 'C06', 'Introduction to Financial Accounting', 'Rebecca I.  Bloch'),
 (7, 'Fall2014', 'G', 'Introduction to Financial Accounting', 'Paul   Caster'),
 (8, 'Fall2014', 'H', 'Introduction to Financial Accounting', 'Jo Ann   Drusbosky'),
 (9, 'Fall2014', 'I', 'Introduction to Financial Accounting', 'Jo Ann   Drusbosky'),
 (10, 'Fall2014', 'J', 'Introduction to Financial Accounting', 'Jo Ann   Drusbosky')]

CREATE CATALOG_INFO TABLE

In [57]:
%%sql
DROP TABLE Catalog_Info;
CREATE TABLE Catalog_Info (
    catalog_id INTEGER SURROGATE KEY,
    program_code TEXT NOT NULL,
    program_name TEXT NOT NULL,
    prereqs TEXT NOT NULL,
    coreqs TEXT NOT NULL
    );

   sqlite:///CourseDataWarehouse.db
 * sqlite:///CourseDataWarehouse1.db
Done.
Done.

[]

In [58]:
%%sql
INSERT INTO Catalog_Info (catalog_id,program_code, program_name, prereqs, coreqs)
SELECT DISTINCT catalog_id,program_code, program_name, prereqs, coreqs
FROM coursecatalog;

   sqlite:///CourseDataWarehouse.db
 * sqlite:///CourseDataWarehouse1.db
2220 rows affected.

[]

In [59]:
%%sql
SELECT *
FROM Catalog_Info
LIMIT 10;

   sqlite:///CourseDataWarehouse.db
 * sqlite:///CourseDataWarehouse1.db
Done.

[('AN 0301', 'AN', 'Asian Studies', '', ''),
 ('AN 0310', 'AN', 'Asian Studies', '', ''),
 ('BU 0211', 'BU', 'Business', 'Junior standing.', ''),
 ('BU 0220', 'BU', 'Business', '', ''),
 ('BU 0311', 'BU', 'Business', 'BU 0211.', ''),
 ('BU 0312', 'BU', 'Business', 'BU 0211.', ''),
 ('BU 0320', 'BU', 'Business', '', ''),
 ('BU 0391', 'BU', 'Business', 'AE 0291, BU 0211, two additional courses in law or applied ethics.', ''),
 ('BL 0101', 'BL', 'Black Studies', '', ''),
 ('BL 0398', 'BL', 'Black Studies', '', '')]

CREATE FACT TABLE

In [68]:
%%sql
DROP TABLE Fact;
CREATE TABLE Fact (
    crn INTEGER NOT NULL,
    credits INTEGER NOT NULL,
    location_ID INTEGER NOT NULL,
    course_ID INTEGER NOT NULL,
    catalog_id INTEGER,
    fees TEXT,
    day TEXT NOT NULL,
    start TEXT NOT NULL,
    end TEXT NOT NULL,
    FOREIGN KEY(location_ID) REFERENCES Location(location_ID),
    FOREIGN KEY(course_ID) REFERENCES Course_Info(course_ID),
    FOREIGN KEY(catalog_id) REFERENCES Catalog_Info(catalog_id)
    );

   sqlite:///CourseDataWarehouse.db
 * sqlite:///CourseDataWarehouse1.db
Done.
Done.

[]

In [69]:
%%sql
select * 
from Fact
LIMIT 10

   sqlite:///CourseDataWarehouse.db
 * sqlite:///CourseDataWarehouse1.db
Done.

[]

In [70]:
%%sql
INSERT INTO Fact (crn,credits,location_ID,course_ID,catalog_id,fees,day,start,end)
SELECT CM.crn,C.credits,L.location_ID,CSI.course_ID,CAI.catalog_id,fees,day,start,end
FROM coursemeetings CM
    LEFT JOIN Location L ON CM.location=L.location
    LEFT JOIN Courses C ON C.crn=CM.crn
    LEFT JOIN coursecatalog CC ON CC.catalog_id = C.catalog_id
    LEFT JOIN Course_Info CSI ON CSI.title = C.title 
                                AND CSI.section = C.section
                                AND CSI.term = C.term
    LEFT JOIN Catalog_info CAI ON CAI.catalog_id = C.catalog_id;

   sqlite:///CourseDataWarehouse.db
 * sqlite:///CourseDataWarehouse1.db
911155 rows affected.

[]

In [71]:
%%sql
SELECT *
FROM Fact
LIMIT 10;

   sqlite:///CourseDataWarehouse.db
 * sqlite:///CourseDataWarehouse1.db
Done.

[(70384, 3, 1, 1, 'AC 0011', '', 'T', '2014-09-02T08:00:00', '2014-09-02T09:15:00'),
 (70384, 3, 1, 1, 'AC 0011', '', 'T', '2014-09-02T08:00:00', '2014-09-02T09:15:00'),
 (70384, 3, 1, 1, 'AC 0011', '', 'F', '2014-09-05T08:00:00', '2014-09-05T09:15:00'),
 (70384, 3, 1, 1, 'AC 0011', '', 'F', '2014-09-05T08:00:00', '2014-09-05T09:15:00'),
 (70384, 3, 1, 1, 'AC 0011', '', 'T', '2014-09-09T08:00:00', '2014-09-09T09:15:00'),
 (70384, 3, 1, 1, 'AC 0011', '', 'T', '2014-09-09T08:00:00', '2014-09-09T09:15:00'),
 (70384, 3, 1, 1, 'AC 0011', '', 'F', '2014-09-12T08:00:00', '2014-09-12T09:15:00'),
 (70384, 3, 1, 1, 'AC 0011', '', 'F', '2014-09-12T08:00:00', '2014-09-12T09:15:00'),
 (70384, 3, 1, 1, 'AC 0011', '', 'T', '2014-09-16T08:00:00', '2014-09-16T09:15:00'),
 (70384, 3, 1, 1, 'AC 0011', '', 'T', '2014-09-16T08:00:00', '2014-09-16T09:15:00')]